rails_curriculum/05_rails_auth_II/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
    <option></option>
    <% Cat.all.each do |cat| %>