react_curriculum/16_frontend_auth/app/controllers/api/chirps_controller.rb

SELECT "chirps".* FROM "chirps"
---
  def index
    @chirps = Chirp.all