sql_curriculum/08_url_shortener/URLShortener/app/models/short_url.rb

SELECT  1 AS one FROM "short_urls" WHERE "short_urls"."short_url" = $1 LIMIT $2  [["short_url", "X6IZ7yjKC7DwRn3iGWgrkQ"], ["LIMIT", 1]]
---
  def self.random_code
    new_url = SecureRandom.urlsafe_base64

    until !ShortURL.exists? short_url: new_url

INSERT INTO "short_urls" ("short_url", "long_url", "submit_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "X6IZ7yjKC7DwRn3iGWgrkQ"], ["long_url", "asdasd"], ["submit_user_id", 1], ["created_at", "2019-09-21 20:36:57.246398"], ["updated_at", "2019-09-21 20:36:57.246398"]]
---
  def self.generate_short_url(user, long_url)
    ShortURL.create! submit_user_id: user.id, long_url: long_url, short_url: ShortURL.random_code