rails_curriculum/08_capybara/music_app/app/views/albums/show.html.erb

  <h2>Tracks Available</h2>
  <% if @album.tracks.length > 0 %>
  <ul>
    <% @album.tracks.each do |track| %>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 1]]