javascript_curriculum/28_ajax_twitter/app/views/tweets/_form.html.erb

      <option></option>
      <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"