rails_curriculum/09_goal_app/goalApp/app/views/users/show.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 1]]
---

<% @user.goals.each do |goal| %>