rails_curriculum/05_rails_auth_II/app/controllers/application_controller.rb

  def current_user
    return nil if !session[:session_token]
    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "bpAqryl3e_81_pnQJwbNug"], ["LIMIT", 1]]