rails_curriculum/05_rails_auth_II/app/controllers/cat_rental_requests_controller.rb

  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 2], ["end_date", "2019-11-15"], ["start_date", "2019-11-06"], ["status", "PENDING"], ["created_at", "2019-11-29 05:03:02.552984"], ["updated_at", "2019-11-29 05:03:02.552984"]]

  def current_cat_rental_request
    @rental_request ||=
      CatRentalRequest.includes(:cat).find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 2]]