rails_curriculum/08_capybara/music_app/app/views/bands/show.html.erb

<ul class='album-links'>
  <% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]