rails_curriculum/03_99cats/cats/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2019-11-14' OR end_date < '2019-11-06') AND "cat_rental_requests"."status" = $3  [["id", 1], ["cat_id", 1], ["status", "PENDING"]]
---
  def overlapping_pending_requests
    overlapping_requests.where(status: 'PENDING')

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2019-11-13 03:07:50.095163"], ["id", 28]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2019-11-13 03:07:50.105803"], ["id", 31]]
---
  def approve
    CatRentalRequest.transaction do
      self.status = 'APPROVED'
      self.save!

      overlapping_pending_requests.each do |request|
        request.status = 'DENIED'
        request.save!