rails_curriculum/07_music_app/music_app/app/controllers/notes_controller.rb

  def create
    note = Note.new(note_params)

    if note.save!
---
INSERT INTO "notes" ("note", "user_id", "track_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["note", "hello lol"], ["user_id", 18], ["track_id", 4], ["created_at", "2019-12-16 01:56:08.023952"], ["updated_at", "2019-12-16 01:56:08.023952"]]

  def destroy
    note = Note.find(params[:id])

    if current_user.id == note.user_id
      note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 8]]