rails_curriculum/07_music_app/music_app/app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("title", "ord", "lyrics", "album_id", "bonus", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Wo Bist Du"], ["ord", 4], ["lyrics", "Zo Alia"], ["album_id", 1], ["bonus", true], ["created_at", "2019-12-15 03:36:43.037584"], ["updated_at", "2019-12-15 03:36:43.037584"]]
---
  def create
    @track = Track.new(track_params)

    if @track.save!

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @album = Album.find(params[:album_id])
    @band = Band.find(@album.band_id)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @track = Track.find(params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3
---
  def update
    @track = Track.find(params[:id])

    if @track.update_attributes(track_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 2]]
---
  def destroy
    @track = Track.find(params[:id])
    @track.destroy