rails_curriculum/07_music_app/music_app/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "-7HiJlyTbx35hvVWUQ3Hcw"], ["updated_at", "2019-12-06 04:40:13.643334"], ["id", 4]]