react_curriculum/12_jbuilder_exercises/app/controllers/api/gifts_controller.rb

  def index
    @gifts = Gift.where(guest_id: params[:guest_id])
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."guest_id" = $1  [["guest_id", 1]]

  def show
    @gift = Gift.find_by(id: params[:id])
---
SELECT  "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]