react_curriculum/12_jbuilder_exercises/app/controllers/api/guests_controller.rb

SELECT "guests".* FROM "guests"
---
  def index
    @guests = Guest.all

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @guest = Guest.find_by(id: params[:id])