react_curriculum/12_jbuilder_exercises/app/controllers/api/parties_controller.rb

SELECT "parties".* FROM "parties"
---
  def index
    @parties = Party.all

SELECT  DISTINCT "parties"."id" FROM "parties" LEFT OUTER JOIN "invitations" ON "invitations"."party_id" = "parties"."id" LEFT OUTER JOIN "guests" ON "guests"."id" = "invitations"."guest_id" LEFT OUTER JOIN "gifts" ON "gifts"."guest_id" = "guests"."id" WHERE "parties"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "gifts".* FROM "gifts" WHERE "gifts"."guest_id" = $1  [["guest_id", 3]]
---
  def show
    @party = Party.includes(guests: [:gifts]).find(params[:id])