rails_curriculum/17_reddit_clone/reddit_clone/app/views/posts/_form.html.erb


  <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"

             value="<%= sub.id %>"
             <%= "checked" if post.sub_ids.include?(sub.id) %>>
---
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 8]]