rails_curriculum/17_reddit_clone/reddit_clone/app/views/posts/show.html.erb

<h1><%= @post.title %> by <%= User.find(@post.author_id).username %></h1>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

<h3>Subs</h3>
<% @post.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]