rails_curriculum/06_helpers_layouts_partials/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
      <option></option>
      <% Cat.all.each do |cat| %>