rails_curriculum/07_music_app/music_app/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
<select name="album[band_id]" id="album_band">
  <% Band.all.each do |band| %>