rails_curriculum/07_music_app/music_app/app/views/notes/_note.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 4]]
---
<% track.notes.all.each do |note| %>