rails_curriculum/17_reddit_clone/reddit_clone/app/models/post.rb

  def comments_by_parent_id
    comment_ids = {}

    self.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 11]]