rails_curriculum/17_reddit_clone/reddit_clone/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1  [["sub_id", 10]]
---
<%= link_to 'Make New Post!', new_post_url %><br><br>
<% @sub.posts.each do |post| %>