rails_curriculum/17_reddit_clone/reddit_clone/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "oHAdZfnEOU3NBkwtkIYVjA"], ["LIMIT", 1]]
---
  def current_user
    return nil if !session[:session_token]
    @current_user ||= User.find_by(session_token: session[:session_token])