rails_curriculum/17_reddit_clone/reddit_clone/app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "hello there"], ["author_id", 8], ["post_id", 1], ["created_at", "2020-02-01 23:18:39.963374"], ["updated_at", "2020-02-01 23:18:39.963374"], ["parent_comment_id", 1]]