rails_curriculum/17_reddit_clone/reddit_clone/app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "cool sub"], ["url", ""], ["content", ""], ["sub_id", 1], ["author_id", 8], ["created_at", "2020-01-29 05:38:21.568662"], ["updated_at", "2020-01-29 05:38:21.568662"]]

  def show
    @post = Post.find(params[:id])
    @all_comments = @post.comments.includes(:author)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 8]]

  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", " latest version of post xx"], ["updated_at", "2020-01-30 15:43:50.065902"], ["id", 8]]

  def verify_author
    post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]