rails_curriculum/17_reddit_clone/reddit_clone/app/controllers/subs_controller.rb

  def create
    @sub = current_user.subs.new(sub_params)

    if @sub.save
---
INSERT INTO "subs" ("title", "description", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test sub"], ["description", "this is a test"], ["author_id", 8], ["created_at", "2020-01-28 06:14:00.318276"], ["updated_at", "2020-01-28 06:14:00.318276"]]

  def update
    @sub = Sub.find(params[:id])

    if @sub.update_attributes(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "lmfaojj"], ["updated_at", "2020-01-28 06:42:10.806209"], ["id", 6]]

  def verify_moderator
    sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]