rails_curriculum/09_goal_app/goalApp/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "83wVOmdFG_kzYmd2nrAttA"], ["LIMIT", 1]]
---
  def current_user
    return nil if !session[:session_token]
    @user ||= User.find_by(session_token: session[:session_token])