rails_curriculum/09_goal_app/goalApp/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id

    if @comment.save
---
INSERT INTO "comments" ("comment", "author_id", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment", "testing"], ["author_id", 6], ["commentable_type", "User"], ["commentable_id", 3], ["created_at", "2020-01-06 05:44:05.537256"], ["updated_at", "2020-01-06 05:44:05.537256"]]