rails_curriculum/09_goal_app/goalApp/app/controllers/goals_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "goals" ("title", "details", "user_id", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdoaksdosadk"], ["details", "lkasldkalsdkalskd "], ["user_id", 6], ["completed", true], ["created_at", "2020-01-02 00:38:18.563866"], ["updated_at", "2020-01-02 00:38:18.563866"]]
---
  def create
    @goal = current_user.goals.new(goal_params)

    if @goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @goal = Goal.find(params[:id])

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 3]]
---
  def destroy
    @goal = Goal.find(params[:id])
    @goal.destroy

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "goals" SET "title" = $1, "details" = $2, "completed" = $3, "updated_at" = $4 WHERE "goals"."id" = $5  [["title", "new"], ["details", "          aisjdaijdaisjdxkxkxkxk"], ["completed", true], ["updated_at", "2020-01-01 19:46:05.768960"], ["id", 2]]
---
  def update
    @goal = Goal.find(params[:id])

    if @goal.update_attributes(goal_params)

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @goal = Goal.find(params[:id])