rails_curriculum/02_art_share_api/app/controllers/artworks_controller.rb

  def index
    artist = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    artwork = Artwork.new(artworks_params)

    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "beautiful canada"], ["image_url", "imageshack.us/beaut_canada"], ["artist_id", 2], ["created_at", "2019-10-27 01:24:38.839819"], ["updated_at", "2019-10-27 01:24:38.839819"]]

  def update
    artwork = Artwork.find(params[:id])

    if artwork.update(artworks_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "newer painting"], ["updated_at", "2019-10-27 02:02:42.252831"], ["id", 4]]