rails_curriculum/02_art_share_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
  def index
    render json: Artwork.all