rails_curriculum/02_art_share_api/app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comments_params)

    if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "comment_body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["artwork_id", 2], ["comment_body", "not bad"], ["created_at", "2019-10-28 02:58:58.810039"], ["updated_at", "2019-10-28 02:58:58.810039"]]

  def destroy
    comment = Comment.find(params[:id])

    if comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]

  def index
    if params[:user_id]
      render json: Comment.where(user_id: params[:user_id])
    elsif params[:artwork_id]
      render json: Comment.where(artwork_id: params[:artwork_id])
    else
      render json: Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT "comments".* FROM "comments"