rails_curriculum/02_art_share_api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    render json: Comment.all