rails_curriculum/02_art_share_api/app/controllers/users_controller.rb

  def index
    if params[:username]
      render json: User.where(username: params[:username])
    else
      render json: User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Fares"]]
SELECT "users".* FROM "users"