rails_curriculum/08_capybara/music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Earthquake"], ["year", 2003], ["band_id", 1], ["live", true], ["created_at", "2019-12-09 03:24:40.199855"], ["updated_at", "2019-12-09 03:24:40.199855"]]

  def edit
    @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]

  def update
    @album = Album.find(params[:id])

    if @album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Earthquakexzz"], ["updated_at", "2019-12-13 03:51:00.504126"], ["id", 7]]

  def destroy
    @album = Album.find(params[:id])
    @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 15]]

  def new
    @album = Album.new(band_id: params[:band_id])
    @band = Band.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]