rails_curriculum/08_capybara/music_app/app/controllers/application_controller.rb

  def current_user
    return nil if !session[:session_token]
    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "6K7c7SHjWD4q96QyWG2ZVA"], ["LIMIT", 1]]