rails_curriculum/08_capybara/music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "RAMMSTEIN"], ["updated_at", "2019-12-08 04:07:08.841084"], ["id", 1]]
---
  def update
    @band = Band.find(params[:id])

    if @band.update_attributes(band_params)