rails_curriculum/05_rails_auth_II/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "Christopher"], ["LIMIT", 1]]
---
  def find_by_credentials(user_name, password)
    user = User.find_by(user_name: user_name)