rails_curriculum/06_helpers_layouts_partials/app/controllers/cats_controller.rb

  def create
    @cat = current_user.cats.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @cat = current_user.cats.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT $3  [["user_id", 11], ["id", 1], ["LIMIT", 1]]