javascript_curriculum/28_ajax_twitter/app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hi there"], ["user_id", 8], ["created_at", "2020-04-18 17:32:13.686594"], ["updated_at", "2020-04-18 17:32:13.686594"]]
---
  def create
    # simulate latency
    sleep(1)

    @tweet = current_user.tweets.build(tweet_params)

    if @tweet.save