rails_curriculum/03_99cats/cats/app/views/cat_rental_requests/show.html.erb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<h1>Ahh you rented <%= Cat.find(@request.cat_id).name %>!</h1>