rails_curriculum/03_99cats/cats/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 3]]
---
<ul>
<% ordered_cats = @cat.rental_requests.order(:start_date) %>