rails_curriculum/03_99cats/cats/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
  def new
    @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2019-11-12"], ["end_date", "2019-11-23"], ["created_at", "2019-11-10 05:01:38.138732"], ["updated_at", "2019-11-10 05:01:38.138732"]]
---
  def create
    @cat = Cat.find_by(id: cat_rental_request_params[:cat_id])
    @request = CatRentalRequest.new(cat_rental_request_params)

    if @request.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def approve
    @request = CatRentalRequest.find_by(id: params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def deny
    @request = CatRentalRequest.find_by(id: params[:id])