rails_curriculum/03_99cats/cats/app/controllers/cat_rental_requests_controller.rb

  def show
    @request = CatRentalRequest.find_by(id: params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]