rails_curriculum/03_99cats/cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "asdasdasdasdxxssss"], ["description", "Ahhh!xxasd"], ["updated_at", "2019-11-07 04:41:47.036541"], ["id", 4]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

      if @cat.update_attributes(cat_params)