javascript_curriculum/28_ajax_twitter/app/models/user.rb

  def feed_tweets(limit = nil, max_created_at = nil)
    @tweets = Tweet
      .joins(:user)
      .joins('LEFT OUTER JOIN follows ON users.id = follows.followee_id')
      .where('tweets.user_id = :id OR follows.follower_id = :id', id: self.id)
      .order('tweets.created_at DESC')
      .distinct

    if limit
     @tweets = @tweets.limit(limit)
    end

    if max_created_at
     @tweets = @tweets.where('tweets.created_at < ?', max_created_at)
---
SELECT "follows"."followee_id" FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 8]]